app/searches/customer_search.rb

  def ids
    if options.present?
      sql = Customer.sanitize_sql([customer_search_base_query])
      options_with_search_methods.each do |_options, method_name|
        sql += public_send(method_name)
      end
      Customer.connection.exec_query(sql).cast_values
    else
      Customer.pluck(:id)
---
SELECT "customers"."id" FROM "customers"