app/operations/customer_groups/create.rb

INSERT INTO "customer_groups" ("name", "is_deafult", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "\"Group 2\""], ["is_deafult", nil], ["created_at", "2024-12-16 15:40:20.756048"], ["updated_at", "2024-12-16 15:40:20.756048"]]
---
      def save_customer_group(customer_group, error_tracker)
        return customer_group if customer_group.save