app/controllers/customer_groups_controller.rb

SELECT "customer_groups".* FROM "customer_groups" WHERE "customer_groups"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def set_customer_group
    @customer_group = CustomerGroup.find(params[:id])